In [1]:
import pandas as pd
import numpy as np

In [2]:
df = pd.read_csv('insurance.csv')
df.head()

   age     sex     bmi  children smoker     region      charges
0   19  female  27.900         0    yes  southwest  16884.92400
1   18    male  33.770         1     no  southeast   1725.55230
2   28    male  33.000         3     no  southeast   4449.46200
3   33    male  22.705         0     no  northwest  21984.47061
4   32    male  28.880         0     no  northwest   3866.85520

In [27]:
df1 = df.copy()
df2 = df.copy()
df3 = df.copy()
df4 = df.copy()
df5 = df.copy()

In [4]:
df.isnull().sum()

age         0
sex         0
bmi         0
children    0
smoker      0
region      0
charges     0
dtype: int64

# Label Encoder

In [5]:
from sklearn import preprocessing
le = preprocessing.LabelEncoder()

In [6]:
le.fit_transform(df['sex'])

array([0, 1, 1, ..., 0, 0, 0])

In [7]:
df['sex'] = le.fit_transform(df['sex'])
df.head()

   age  sex     bmi  children smoker     region      charges
0   19    0  27.900         0    yes  southwest  16884.92400
1   18    1  33.770         1     no  southeast   1725.55230
2   28    1  33.000         3     no  southeast   4449.46200
3   33    1  22.705         0     no  northwest  21984.47061
4   32    1  28.880         0     no  northwest   3866.85520

In [8]:
from pandas.core.dtypes.common import is_numeric_dtype

In [9]:
df.columns

Index(['age', 'sex', 'bmi', 'children', 'smoker', 'region', 'charges'], dtype='object')

In [28]:
for col in df1.columns:
    if is_numeric_dtype(df1[col]):
        continue
    else:
        df1[col] = le.fit_transform(df1[col])

In [29]:
 df1.head()

   age  sex     bmi  children  smoker  region      charges
0   19    0  27.900         0       1       3  16884.92400
1   18    1  33.770         1       0       2   1725.55230
2   28    1  33.000         3       0       2   4449.46200
3   33    1  22.705         0       0       1  21984.47061
4   32    1  28.880         0       0       1   3866.85520

# One Hot

In [12]:
df2.head()

   age     sex     bmi  children smoker     region      charges
0   19  female  27.900         0    yes  southwest  16884.92400
1   18    male  33.770         1     no  southeast   1725.55230
2   28    male  33.000         3     no  southeast   4449.46200
3   33    male  22.705         0     no  northwest  21984.47061
4   32    male  28.880         0     no  northwest   3866.85520

In [13]:
new = pd.get_dummies(df2['sex'])
new.head()

   female  male
0       1     0
1       0     1
2       0     1
3       0     1
4       0     1

In [14]:
new = pd.get_dummies(df2['sex'], prefix='sex', drop_first=True)
new.head()

   sex_male
0         0
1         1
2         1
3         1
4         1

In [15]:
df2.drop('sex', axis=1, inplace=True)

In [16]:
df2.head()

   age     bmi  children smoker     region      charges
0   19  27.900         0    yes  southwest  16884.92400
1   18  33.770         1     no  southeast   1725.55230
2   28  33.000         3     no  southeast   4449.46200
3   33  22.705         0     no  northwest  21984.47061
4   32  28.880         0     no  northwest   3866.85520

# Ordinal

In [30]:
df4.sex.unique()

array([0, 1])

In [31]:
from sklearn.preprocessing import OrdinalEncoder

In [32]:
men = df4.sex.unique()
demanding = OrdinalEncoder(categories=[men])
encoded = demanding.fit_transform(df4[['sex']])

In [33]:
df4['sex'] = encoded
df4.head()

   age  sex     bmi  children smoker     region      charges
0   19  0.0  27.900         0    yes  southwest  16884.92400
1   18  1.0  33.770         1     no  southeast   1725.55230
2   28  1.0  33.000         3     no  southeast   4449.46200
3   33  1.0  22.705         0     no  northwest  21984.47061
4   32  1.0  28.880         0     no  northwest   3866.85520

In [34]:
df5.region.unique()

array(['southwest', 'southeast', 'northwest', 'northeast'], dtype=object)

In [35]:
reg = df5.region.unique()
offer = OrdinalEncoder(categories=[reg])
encoded = offer.fit_transform(df5[['region']])

In [36]:
df5['region'] = encoded
df5.head()

   age  sex     bmi  children smoker  region      charges
0   19    0  27.900         0    yes     0.0  16884.92400
1   18    1  33.770         1     no     1.0   1725.55230
2   28    1  33.000         3     no     1.0   4449.46200
3   33    1  22.705         0     no     2.0  21984.47061
4   32    1  28.880         0     no     2.0   3866.85520